In [17]:
import pandas as pd
import numpy as np

s = pd.Series()
s
data = pd.Series([1,2,3,4])
data
data2 = pd.Series(['a','b','c','d'])
data2
data3 = pd.Series(['a','b','c','d'],index=[100,110,120,130])
data3

a = np.array([1,2,3,4])
a

data4 = pd.Series(a,index=[10,20,30,40])
data4
dic1 = {1:'test',2:'test2',3:'test3'}
data5 = pd.Series(dic1)
data5

data6 = pd.Series(dic1, index = [3,1,2])
data6

3    test3
1     test
2    test2
dtype: object

In [29]:
data7 = pd.Series(5,index=[1,2,3,4,5,6])
data7
data8 = pd.Series([1,2,3,4,5,6])
data8[0]
data8[:3]
data8 = pd.Series([1,2,3,4,5,6],index=['a','b','c','d',104,105])
data8
data8['a']

data8[['c','a','b']]
data8[data8>3]

d      4
104    5
105    6
dtype: int64

In [41]:
# Lists,Dict,Series,Numpy arrays, DataFrame

import numpy as np
import pandas as pd
df = pd.DataFrame()
type(df)
df
df1 = pd.DataFrame([1,2,3,4,5,6])
df1
df2 = pd.DataFrame([[1,2],[3,4]])
df2
df3 = pd.DataFrame([['test1',10],['test2',20],['test3',30]],columns=['name','age'],dtype = float)
df3

    name   age
0  test1  10.0
1  test2  20.0
2  test3  30.0

In [49]:
df4 = pd.DataFrame({'name':['이순신','강감찬','홍길동','을지문덕'],'age':[20,21,22,23]},
                    index = ['no1','no2','no3','no4'], columns=['age','name'])
df4

     age  name
no1   20   이순신
no2   21   강감찬
no3   22   홍길동
no4   23  을지문덕

In [50]:
df5 = pd.DataFrame([{'no1':10,'no2':20},{'no1':100,'no2':200,'no3':300}],
                    index=['one','two'],columns=['no3','no2','no1'])
df5

       no3  no2  no1
one    NaN   20   10
two  300.0  200  100

In [56]:
col1 = pd.Series([1,2,3],index=['a','b','c'])
col2 = pd.Series([3,4,5],index=['a','b','c'])
df6 = pd.DataFrame({'one':col1,'two':col2})

df6

   one  two
a    1    3
b    2    4
c    3    5

In [72]:
df6['three'] = 0
df6

   one  two  three
a    1    3      0
b    2    4      0
c    3    5      0

In [73]:
#df6['three'] = pd.Series([7,8,8])
df6

   one  two  three
a    1    3      0
b    2    4      0
c    3    5      0

In [57]:
df6['one']

a    1
b    2
c    3
Name: one, dtype: int64

In [58]:
type(df6)

pandas.core.frame.DataFrame

In [59]:
type(df6['one'])

pandas.core.series.Series

In [74]:
df6['four'] = df6['one'] + df6['two']
df6

   one  two  three  four
a    1    3      0     4
b    2    4      0     6
c    3    5      0     8

In [65]:
del df6['three']
df6

   one  two
a    1    3
b    2    4
c    3    5

In [76]:
df6['three'] = pd.Series([3,1,6],index=['a','b','c'])
df6

   one  two  three  four
a    1    3      3     4
b    2    4      1     6
c    3    5      6     8

In [85]:
data8

#4 in data8
104 in data8 # 인덱스가 존재하는지 확인

True

In [87]:
import numpy as np
import pandas as pd

data = [[1,2],[3,4]]
df = pd.DataFrame(data,index=['row1','row2'],columns=['col1','col2'])
df

      col1  col2
row1     1     2
row2     3     4

In [88]:
df['col2']

row1    2
row2    4
Name: col2, dtype: int64

In [89]:
d = df.loc['row1']
d

col1    1
col2    2
Name: row1, dtype: int64

In [90]:
d2 = df.iloc[0]
d2

col1    1
col2    2
Name: row1, dtype: int64

In [91]:
df.iloc[1]

col1    3
col2    4
Name: row2, dtype: int64

In [92]:
df[:1]

      col1  col2
row1     1     2

In [ ]:
data22 = {'one':[1,2,3,4,5],'two':[5,6,7,8,9]}